---
kind: other
id: Properties.T:Autodesk.Revit.DB.Plumbing.PipeSettings
source: html/126a7139-5a17-b1ce-1c8e-bfbd16d7a7cb.htm
---
# PipeSettings Properties

Indicates whether to enable analysis for closed loop hydronic piping networks.